In [1]:
import pandas as pd
import numpy as np

### ordinal number Encoding

In ordinal encoding, each unique category value is assigned an integer value. For example, “ red ” is 1, “ green ” is 2, and “ blue ” is 3. This is called an ordinal encoding or an integer encoding and is easily reversible. Often, integer values starting at zero are used. For some variables, an ordinal encoding may be enough.

In [2]:
import datetime

In [3]:
today_date=datetime.datetime.today()

In [4]:
today_date

datetime.datetime(2021, 8, 20, 6, 50, 47, 261459)

In [6]:
today_date-datetime.timedelta(2)

datetime.datetime(2021, 8, 18, 6, 50, 47, 261459)

In [8]:
##list comprehension
[today_date-datetime.timedelta(x) for x in range(0,15)]

[datetime.datetime(2021, 8, 20, 6, 50, 47, 261459),
 datetime.datetime(2021, 8, 19, 6, 50, 47, 261459),
 datetime.datetime(2021, 8, 18, 6, 50, 47, 261459),
 datetime.datetime(2021, 8, 17, 6, 50, 47, 261459),
 datetime.datetime(2021, 8, 16, 6, 50, 47, 261459),
 datetime.datetime(2021, 8, 15, 6, 50, 47, 261459),
 datetime.datetime(2021, 8, 14, 6, 50, 47, 261459),
 datetime.datetime(2021, 8, 13, 6, 50, 47, 261459),
 datetime.datetime(2021, 8, 12, 6, 50, 47, 261459),
 datetime.datetime(2021, 8, 11, 6, 50, 47, 261459),
 datetime.datetime(2021, 8, 10, 6, 50, 47, 261459),
 datetime.datetime(2021, 8, 9, 6, 50, 47, 261459),
 datetime.datetime(2021, 8, 8, 6, 50, 47, 261459),
 datetime.datetime(2021, 8, 7, 6, 50, 47, 261459),
 datetime.datetime(2021, 8, 6, 6, 50, 47, 261459)]

In [9]:
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [10]:
data=pd.DataFrame(days)
data.columns=["Day"]

In [11]:
data.head()

                         Day
0 2021-08-20 06:50:47.261459
1 2021-08-19 06:50:47.261459
2 2021-08-18 06:50:47.261459
3 2021-08-17 06:50:47.261459
4 2021-08-16 06:50:47.261459

In [12]:
data['Day'].dt.weekday_name

0        Friday
1      Thursday
2     Wednesday
3       Tuesday
4        Monday
5        Sunday
6      Saturday
7        Friday
8      Thursday
9     Wednesday
10      Tuesday
11       Monday
12       Sunday
13     Saturday
14       Friday
Name: Day, dtype: object

In [16]:
data['weekday']=data['Day'].dt.weekday_name

In [17]:
data.head()

                         Day    weekday
0 2021-08-20 06:50:47.261459     Friday
1 2021-08-19 06:50:47.261459   Thursday
2 2021-08-18 06:50:47.261459  Wednesday
3 2021-08-17 06:50:47.261459    Tuesday
4 2021-08-16 06:50:47.261459     Monday

In [29]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7
    
    
}

In [30]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [31]:
data['weekday'].map(dictionary)

0     5
1     4
2     3
3     2
4     1
5     7
6     6
7     5
8     4
9     3
10    2
11    1
12    7
13    6
14    5
Name: weekday, dtype: int64

In [32]:
data['weekday_ordinal']=data['weekday'].map(dictionary)

In [33]:
data

                          Day    weekday  weekday_ordinal
0  2021-08-20 06:50:47.261459     Friday                5
1  2021-08-19 06:50:47.261459   Thursday                4
2  2021-08-18 06:50:47.261459  Wednesday                3
3  2021-08-17 06:50:47.261459    Tuesday                2
4  2021-08-16 06:50:47.261459     Monday                1
5  2021-08-15 06:50:47.261459     Sunday                7
6  2021-08-14 06:50:47.261459   Saturday                6
7  2021-08-13 06:50:47.261459     Friday                5
8  2021-08-12 06:50:47.261459   Thursday                4
9  2021-08-11 06:50:47.261459  Wednesday                3
10 2021-08-10 06:50:47.261459    Tuesday                2
11 2021-08-09 06:50:47.261459     Monday                1
12 2021-08-08 06:50:47.261459     Sunday                7
13 2021-08-07 06:50:47.261459   Saturday                6
14 2021-08-06 06:50:47.261459     Friday                5

### count or frequency Encoding

In [34]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [35]:
train_set[1].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [36]:
len(train_set[1].unique())

9

In [39]:
train_set=train_set[columns]

In [40]:
train_set.columns=['Employment','Degree', 'Status','Designation', 'Family_Job', 'race',' Sex','country']

In [43]:
train_set.head()

,Employment,Degree,Status,Designation,Family_Job,race,Sex,country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [44]:
for feature in train_set.columns[:]:
    print(feature,":",len(train_set[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
Family_Job : 6 labels
race : 5 labels
 Sex : 2 labels
country : 42 labels

In [48]:
country_map=train_set['country'].value_counts().to_dict()

In [50]:
train_set['country']=train_set['country'].map(country_map)
train_set.head(20)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

,Employment,Degree,Status,Designation,Family_Job,race,Sex,country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
5,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170
6,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81
7,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
8,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,29170
9,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
10,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,Black,Male,29170
11,State-gov,Bachelors,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,100
12,Private,Bachelors,Never-married,Adm-clerical,Own-child,White,Female,29170
13,Private,Assoc-acdm,Never-married,Sales,Not-in-family,Black,Male,29170
14,Private,Assoc-voc,Married-civ-spouse,Craft-repair,Husband,Asian-Pac-Islander,Male,583
15,Private,7th-8th,Married-civ-spouse,Transport-moving,Husband,Amer-Indian-Eskimo,Male,643
16,Self-emp-not-inc,HS-grad,Never-married,Farming-fishing,Own-child,White,Male,29170
17,Private,HS-grad,Never-married,Machine-op-inspct,Unmarried,White,Male,29170
18,Private,11th,Married-civ-spouse,Sales,Husband,White,Male,29170
19,Self-emp-not-inc,Masters,Divorced,Exec-managerial,Unmarried,White,Female,29170

##### Advantages
 Easy To Use
 
 Not increasing feature space
##### Disadvantages
 It will provide same weight if the frequencies are same
 
### Target Guided Ordinal Encoding

Ordering the labels according to the target

Replace the labels by the joint probability of being 1 or 0

In [52]:
df=pd.read_csv('F:\\program\\dataset\\titanic_train.csv', usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [54]:
 df['Cabin'].fillna('missing',inplace=True)

In [55]:
df.head()

   Survived    Cabin
0         0  missing
1         1      C85
2         1  missing
3         1     C123
4         0  missing

In [56]:
df['Cabin'].astype(str).str[0]

0      m
1      C
2      m
3      C
4      m
      ..
886    m
887    B
888    m
889    C
890    m
Name: Cabin, Length: 891, dtype: object

In [57]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [58]:
df.head()

   Survived Cabin
0         0     m
1         1     C
2         1     m
3         1     C
4         0     m

In [60]:
df.Cabin.unique()

array(['m', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [62]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
T    0.000000
m    0.299854
Name: Survived, dtype: float64

In [63]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'm', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [64]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'm', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [65]:
enumerate(ordinal_labels,0)

In [66]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'm': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [67]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     m                     1
1         1     C                     4
2         1     m                     1
3         1     C                     4
4         0     m                     1

### Mean Encoding

In [68]:

mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [69]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'T': 0.0,
 'm': 0.29985443959243085}

In [70]:
df['mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     m                     1             0.299854
1         1     C                     4             0.593220
2         1     m                     1             0.299854
3         1     C                     4             0.593220
4         0     m                     1             0.299854